public class Strings {
    public static void main(String[] args) {
        int x = 5;
        String s = "Hello";
        String space = " ";
        String name = "Bob";
        System.out.println(s+space+name);
        System.out.println("Hello" + " " + "John");
        System.out.println("My number is " + x);
    }
}
//Две группы данных - примитивные и ссылочные
//Ссылочный тип данных - строки
//Декларация и инициализация ничем не отличаются в случае примитивных типо данных, но смысл в этом другой.
//примитивные типы начинаются с маленькой буквы, а String с заглавной буквы, почему?
//потому что String является класом, а согласно конвенции классы пишут с большой буквы.
//Пример класса и объекта, допустим класс - это схема, чертеж, а объект это машина построенная по этому чертежу.
//Конкретная произведенная единица это и есть объект. Объект - материальная штука, класс - не материальная.
